; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=129, out_folder=./training, instance_id=3, seed=2027, goal_proportion=0.03

(define (problem blocksworld-03)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 - object)
 (:init 
    (arm-empty)
    (clear b26)
    (on b26 b87)
    (on b87 b98)
    (on b98 b86)
    (on b86 b18)
    (on b18 b90)
    (on b90 b78)
    (on-table b78)
    (clear b17)
    (on b17 b76)
    (on b76 b46)
    (on b46 b4)
    (on b4 b129)
    (on b129 b67)
    (on b67 b71)
    (on b71 b114)
    (on b114 b96)
    (on b96 b5)
    (on b5 b70)
    (on b70 b111)
    (on b111 b128)
    (on b128 b58)
    (on b58 b47)
    (on b47 b106)
    (on b106 b107)
    (on b107 b117)
    (on-table b117)
    (clear b63)
    (on-table b63)
    (clear b75)
    (on b75 b53)
    (on b53 b27)
    (on b27 b7)
    (on-table b7)
    (clear b62)
    (on-table b62)
    (clear b31)
    (on b31 b121)
    (on-table b121)
    (clear b74)
    (on b74 b19)
    (on-table b19)
    (clear b66)
    (on b66 b120)
    (on b120 b93)
    (on b93 b83)
    (on b83 b72)
    (on b72 b92)
    (on-table b92)
    (clear b1)
    (on-table b1)
    (clear b91)
    (on b91 b22)
    (on b22 b64)
    (on-table b64)
    (clear b40)
    (on b40 b89)
    (on b89 b56)
    (on b56 b57)
    (on b57 b126)
    (on b126 b69)
    (on-table b69)
    (clear b6)
    (on b6 b43)
    (on b43 b99)
    (on b99 b110)
    (on b110 b100)
    (on b100 b38)
    (on-table b38)
    (clear b20)
    (on b20 b80)
    (on-table b80)
    (clear b3)
    (on b3 b14)
    (on b14 b15)
    (on b15 b32)
    (on b32 b103)
    (on b103 b73)
    (on-table b73)
    (clear b101)
    (on b101 b127)
    (on b127 b108)
    (on b108 b35)
    (on b35 b113)
    (on-table b113)
    (clear b12)
    (on b12 b50)
    (on b50 b54)
    (on-table b54)
    (clear b112)
    (on b112 b13)
    (on b13 b68)
    (on b68 b34)
    (on b34 b61)
    (on b61 b124)
    (on-table b124)
    (clear b8)
    (on b8 b25)
    (on b25 b16)
    (on-table b16)
    (clear b109)
    (on b109 b41)
    (on b41 b48)
    (on b48 b60)
    (on b60 b95)
    (on b95 b49)
    (on b49 b59)
    (on-table b59)
    (clear b51)
    (on b51 b29)
    (on b29 b115)
    (on-table b115)
    (clear b105)
    (on b105 b94)
    (on b94 b21)
    (on b21 b30)
    (on-table b30)
    (clear b65)
    (on b65 b55)
    (on b55 b123)
    (on b123 b125)
    (on b125 b97)
    (on-table b97)
    (clear b33)
    (on b33 b9)
    (on b9 b39)
    (on b39 b44)
    (on b44 b85)
    (on b85 b82)
    (on-table b82)
    (clear b10)
    (on b10 b79)
    (on-table b79)
    (clear b88)
    (on b88 b37)
    (on b37 b36)
    (on b36 b23)
    (on b23 b77)
    (on b77 b45)
    (on b45 b118)
    (on b118 b122)
    (on b122 b24)
    (on b24 b104)
    (on b104 b116)
    (on-table b116)
    (clear b81)
    (on-table b81)
    (clear b52)
    (on-table b52)
    (clear b102)
    (on b102 b42)
    (on-table b42)
    (clear b84)
    (on b84 b2)
    (on b2 b11)
    (on b11 b119)
    (on b119 b28)
    (on-table b28))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b3 b14)
   deleted: (on b3 b14) (clear b3) (arm-empty)
   added: (holding b3) (clear b14)
   goals met: 1 of 4
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 4
3. (unstack b84 b2)
   deleted: (on b84 b2) (clear b84) (arm-empty)
   added: (holding b84) (clear b2)
   goals met: 2 of 4
4. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 2 of 4
5. (unstack b2 b11)
   deleted: (on b2 b11) (clear b2) (arm-empty)
   added: (holding b2) (clear b11)
   goals met: 2 of 4
6. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 3 of 4
7. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 2 of 4
8. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 4 of 4
